Core/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура);
		Если НЕ (Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			ИЛИ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			ИЛИ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа)
			Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='შტრიხკოდები ინახება მხოლოდ მარაგებისთვის, სამუშაოებისთვის და მომსახურებებისთვის';ru='Штрихкоды хранятся только для запасов, работ и услуг';en='Barcodes are stored only for inventory, works and services'");
			Элементы.Список.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ФормаУcтановитьКакОсновной.Видимость = Ложь;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Элементы.ФормаУcтановитьКакОсновной.Видимость = Истина;
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Параметры.Номенклатура, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
		УстановитьУсловноеОформлениеШрифтТекст(Параметры.Номенклатура);
		
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура УcтановитьКакОсновной(Команда)
		
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда  
		УcтановитьКакОсновнойНаСервере(Элементы.Список.ТекущиеДанные.Номенклатура,Элементы.Список.ТекущиеДанные.Штрихкод);
		Оповестить("ШтрихкодыНоменклатуры", Элементы.Список.ТекущиеДанные.Номенклатура);
	КонецЕсли;
			
КонецПроцедуры 

&НаСервере
Процедура УcтановитьКакОсновнойНаСервере(Номенклатура,Штрихкод)
		

	РегистрыСведений.ШтрихкодыНоменклатуры.УcтановитьКакОсновнойШтрихкод(Номенклатура, Штрихкод);
	УстановитьУсловноеОформлениеШрифтТекст(Номенклатура);
	Элементы.Список.Обновить();
	
КонецПроцедуры 


&НаСервере
Процедура УстановитьУсловноеОформлениеШрифтТекст(Номенклатура)
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокШтрихкод.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокНоменклатура.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокХарактеристика.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СписокНоменклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Номенклатура.ОсновнойШтрихКод;
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Штрихкод",  Номенклатура.ОсновнойШтрихКод, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.НеПринятыеКИсполнениюЗадачи);    
	Элементы.Список.Обновить();
	
КонецПроцедуры
